= XREVRANGE

**语法**

[source,text]
----
XREVRANGE key end start [COUNT count]
----

**可用版本**：5.0.0

**时间复杂度**：O(N)，其中 N 是返回的元素数量。 如果 N 是常量（例如，始终使用 COUNT 请求前 10 个元素），则可以将其视为 O(1)。

**ACL 类别**：**@read, @stream, @slow**

此命令与 XRANGE 完全相同，但显着区别在于以相反顺序返回条目，并且还以相反顺序获取开始结束范围：在 XREVRANGE 中，您需要先声明结束 ID，然后声明开始 ID，然后命令 将从末尾开始生成两个 ID 之间（或完全相同）的所有元素。

例如，要获取从较高 ID 到较低 ID 的所有元素，可以使用：

[source,text]
----
XREVRANGE somestream + -
----

类似地，要仅获取添加到流中的最后一个元素，发送就足够了：

[source,text]
----
XREVRANGE somestream + - COUNT 1
----

== 返回值

https://redis.io/docs/reference/protocol-spec/#resp-arrays[数组]: 该命令返回ID与指定范围匹配的条目，从较高ID到较低ID匹配。 返回的条目是完整的，这意味着返回了 ID 及其组成的所有字段。 此外，返回的条目及其字段和值的顺序与 XADD 添加它们的顺序完全相同。.

== 示例

[source,text]
----
redis> XADD writers * name Virginia surname Woolf
"1693193427441-0"
redis> XADD writers * name Jane surname Austen
"1693193427441-1"
redis> XADD writers * name Toni surname Morrison
"1693193427441-2"
redis> XADD writers * name Agatha surname Christie
"1693193427442-0"
redis> XADD writers * name Ngozi surname Adichie
"1693193427442-1"
redis> XLEN writers
(integer) 5
redis> XREVRANGE writers + - COUNT 1
1) 1) "1693193427442-1"
   2) 1) "name"
      2) "Ngozi"
      3) "surname"
      4) "Adichie"
redis>
----

== 历史

* 从 Redis 版本 6.2.0 开始：添加了 exclusive ranges。
