= EXPIREAT

**语法**

[source,text]
----
EXPIREAT key unix-time-seconds [NX | XX | GT | LT]
----

**可用版本**：1.2.0

**时间复杂度**：O(1)

**ACL 类别**：**@keyspace, @write, @fast**

`EXPIREAT` 与 `EXPIRE` 具有相同的效果和语义，但它不指定代表 TTL（生存时间）的秒数，而是采用绝对 https://en.wikipedia.org/wiki/Unix_time[Unix 时间戳]（自 1970 年 1 月 1 日以来的秒数）。
当时间过去后将立即删除该 key。

该命令的具体语义请参考 `EXPIRE` 的文档。

== 背景

引入 `EXPIREAT` 的目的是为了将 AOF 持久化模式的相对超时转换为绝对超时。当然，它可以直接用来指定给定的 key 应该在未来的给定时间过期。

== 选项

`EXPIREAT` 命令支持以下选项:

* NX -- 只有 key 不存在过期时间时设置过期时间
* XX -- 只有 key 存在过期时间时设置过期时间
* GT -- 只有 key 新的过期时间大于当前过期时间设置过期时间
* LT -- 只有 key 新的过期时间小于当前过期时间设置过期时间

出于 `GT` 和 `LT` 的目的，对于非易失性的 key 被视为无限 TTL。 `GT`, `LT` 和 `NX` 选项是互斥的。


== 返回值

https://redis.io/docs/reference/protocol-spec/#resp-integers[返回整型]:

* 1 如果设置了超时.
* 0 如果未设置超时，则为 0。 例如 key 不存在，或由于提供的参数而跳过操作。


== 示例

[source,text]
----
redis> SET mykey "Hello"
"OK"
redis> EXISTS mykey
(integer) 1
redis> EXPIREAT mykey 1293840000
(integer) 1
redis> EXISTS mykey
(integer) 0
redis>
----

=== 历史

从 Redis 版本 7.0.0 开始：添加了选项：`NX`、`XX`、`GT` 和 `LT`。