= SADD

**语法**

[source,text]
----
SADD key member [member ...]
----

**可用版本**：1.0.0

**时间复杂度**：O(1) 表示添加的每个元素，因此当使用多个参数调用命令时，O(N) 表示添加 N 个元素。

**ACL 类别**：**@write, @set, @fast**

将指定的成员添加到存储在 key 处的集合中。 已属于该集合成员的指定成员将被忽略。 如果 key 不存在，则在添加指定成员之前创建一个新集合。

当 key 存储的值不是集合时，会返回错误。

== 返回值

https://redis.io/docs/reference/protocol-spec/#resp-integers[整数]: 添加到集合中的元素数量，不包括集合中已存在的所有元素。

== 示例

[source,text]
----
redis> SADD myset "Hello"
(integer) 1
redis> SADD myset "World"
(integer) 1
redis> SADD myset "World"
(integer) 0
redis> SMEMBERS myset
1) "Hello"
2) "World"
redis>
----

== 历史

* 从 Redis 版本 2.4.0 开始：接受多个成员参数。