= ZREVRANK

**语法**

[source,text]
----
ZREVRANK key member [WITHSCORE]
----

**可用版本**：2.0.0

**时间复杂度**：O(log(N))

**ACL 类别**：**@read, @sortedset, @fast**

返回存储在 key 处的排序集中成员的排名，分数从高到低排序。 排名（或索引）从 0 开始，也就是说，score 值最大的成员排名为 0。

可选的 WITHSCORE 参数用返回的元素的分数来补充命令的回复。

使用 ZRANK 命令可以获得成员按 score 值递增(从低到高)排列的排名。

== 返回值

如果有序集中存在成员：

* 使用 WITHSCORE，https://redis.io/docs/reference/protocol-spec/#resp-arrays[数组]：：包含成员排名和分数的数组。
* 不使用 WITHSCORE，https://redis.io/docs/reference/protocol-spec/#resp-integers[整数]：会员等级。

如果有序集中不存在成员或 key 不存在：

* 使用 WITHSCORE，https://redis.io/docs/reference/protocol-spec/#resp-arrays[数组]：：nil。
* 不使用 WITHSCORE，https://redis.io/docs/reference/protocol-spec/#resp-bulk-strings[批量字符串]：nil。

请注意，在 RESP3 中 null 和 nullarray 相同，但在 RESP2 中则不同。

== 示例

[source,text]
----
redis> ZADD myzset 1 "one"
(integer) 1
redis> ZADD myzset 2 "two"
(integer) 1
redis> ZADD myzset 3 "three"
(integer) 1
redis> ZREVRANK myzset "one"
(integer) 2
redis> ZREVRANK myzset "four"
(nil)
redis> ZREVRANK myzset "three" WITHSCORE
(error) ERR wrong number of arguments for command
redis> ZREVRANK myzset "four" WITHSCORE
(error) ERR wrong number of arguments for command
redis>
----

== 历史

* 从 Redis 版本 7.2.0 开始：添加了可选的WITHSCORE 参数。