= ZREVRANGEBYSCORE

NOTE: 从 Redis 版本 6.2.0 开始，此命令被视为已弃用。 迁移或编写新代码时，可以用带有 REV 和 BYSCORE 参数的 ZRANGE 替换它。

**语法**

[source,text]
----
ZREVRANGEBYSCORE key max min [WITHSCORES] [LIMIT offset count]
----

**可用版本**：2.2.0

**时间复杂度**：O(log(N)+M)，其中N是排序集合中的元素数量，M是返回的元素数量。如果M是常数(例如，总是要求具有LIMIT的前10个元素)，则可以认为它是O(log(N))。

**ACL 类别**：**@read, @sortedset, @slow**

返回排序集中 key 上分数在 max 和 min 之间的所有元素（包括分数等于 max 或 min 的元素）。 与排序集的默认顺序相反，对于此命令，元素被认为是从高分到低分排序。

具有相同分数的元素按相反的字典顺序返回。

除了顺序相反之外，ZREVRANGEBYSCORE 与 ZRANGEBYSCORE 类似。

== 返回值

https://redis.io/docs/reference/protocol-spec/#resp-arrays[数组]：指定分数范围内的元素列表（可选及其分数）。

== 示例

[source,text]
----
redis> ZADD myzset 1 "one"
(integer) 1
redis> ZADD myzset 2 "two"
(integer) 1
redis> ZADD myzset 3 "three"
(integer) 1
redis> ZREVRANGEBYSCORE myzset +inf -inf
1) "three"
2) "two"
3) "one"
redis> ZREVRANGEBYSCORE myzset 2 1
1) "two"
2) "one"
redis> ZREVRANGEBYSCORE myzset 2 (1
1) "two"
redis> ZREVRANGEBYSCORE myzset (2 (1
(empty array)
redis>
----

== 历史

* 从 Redis 版本 2.1.6 开始：min 和 max 可以互斥。
