= ZREVRANGE

NOTE: 从 Redis 版本 6.2.0 开始，此命令被视为已弃用。 迁移或编写新代码时，可以用带有 REV 参数的 ZRANGE 替换它。

**语法**

[source,text]
----
ZREVRANGE key start stop [WITHSCORES]
----

**可用版本**：1.2.0

**时间复杂度**：O(log(N)+M)，其中N是排序集合中的元素数量，M是返回的元素数量。

**ACL 类别**：**@read, @sortedset, @slow**

返回存储在 key 处的有序集合中指定范围的元素。 这些元素被认为是按照从最高分到最低分的顺序排列的。 字典序降序用于具有相同分数的元素。

除了顺序相反之外，ZREVRANGE 与 ZRANGE 类似。

== 返回值

https://redis.io/docs/reference/protocol-spec/#resp-arrays[数组]：指定范围的元素列表(可选是否含有分数)。

== 示例

[source,text]
----
redis> ZADD myzset 1 "one"
(integer) 1
redis> ZADD myzset 2 "two"
(integer) 1
redis> ZADD myzset 3 "three"
(integer) 1
redis> ZREVRANGE myzset 0 -1
1) "three"
2) "two"
3) "one"
redis> ZREVRANGE myzset 2 3
1) "one"
redis> ZREVRANGE myzset -2 -1
1) "two"
2) "one"
redis>
----
