= LMPOP

**语法**

[source,text]
----
LMPOP numkeys key [key ...] <LEFT | RIGHT> [COUNT count]
----

**可用版本**：7.0.0

**时间复杂度**：O(N+M)，其中 N 是提供的键的数量，M 是返回的元素的数量。

**ACL 类别**：**@write, @list, @slow**

从提供的 key 名称列表中的第一个非空列表键中弹出一个或多个元素。

LMPOP 和 BLMPOP 类似于以下更有限的命令：

* LPOP 或 RPOP 仅采用一个键，并且可以返回多个元素。
* BLPOP 或 BRPOP 采用多个键，但仅从一个键返回一个元素。

请参阅 BLMPOP 了解此命令的阻塞版本。

根据传递的参数从第一个非空列表的左侧或右侧弹出元素。 返回元素的数量限制为非空列表的长度和 count 参数（默认为 1）之间的较小者。

== 返回值

https://redis.io/docs/reference/protocol-spec/#resp-arrays[数组]:

* 当无法弹出任何元素时为 nil。
* 一个双元素数组，第一个元素是从中弹出元素的键的名称，第二个元素是元素数组。

== 示例

[source,text]
----
redis> LMPOP 2 non1 non2 LEFT COUNT 10
(error) object of type 'NoneType' has no len()
redis> LPUSH mylist "one" "two" "three" "four" "five"
(integer) 5
redis> LMPOP 1 mylist LEFT
1) "mylist"
2) 1) "five"
redis> LRANGE mylist 0 -1
1) "four"
2) "three"
3) "two"
4) "one"
redis> LMPOP 1 mylist RIGHT COUNT 10
1) "mylist"
2) 1) "one"
   2) "two"
   3) "three"
   4) "four"
redis> LPUSH mylist "one" "two" "three" "four" "five"
(integer) 5
redis> LPUSH mylist2 "a" "b" "c" "d" "e"
(integer) 5
redis> LMPOP 2 mylist mylist2 right count 3
1) "mylist"
2) 1) "one"
   2) "two"
   3) "three"
redis> LRANGE mylist 0 -1
1) "five"
2) "four"
redis> LMPOP 2 mylist mylist2 right count 5
1) "mylist"
2) 1) "four"
   2) "five"
redis> LMPOP 2 mylist mylist2 right count 10
1) "mylist2"
2) 1) "a"
   2) "b"
   3) "c"
   4) "d"
   5) "e"
redis> EXISTS mylist mylist2
(integer) 0
redis>
----
