= LRANGE

**语法**

[source,text]
----
LRANGE key start stop
----

**可用版本**：1.0.0

**时间复杂度**：O(S+N)，其中 S 是小列表从 HEAD 开始偏移的距离，大列表从最近的结尾(HEAD 或 TAIL)开始偏移的长度；并且 N 是在指定范围内的元素的数量。

**ACL 类别**：**@read, @list, @slow**

返回存储在 key 处的列表的指定元素。 偏移量 `start` 和 `stop` 是从零开始的索引，0 是列表的第一个元素（列表的头部），1 是下一个元素，依此类推。

这些偏移量也可以是负数，表示从列表末尾开始的偏移量。 例如，-1 是列表的最后一个元素，-2 是倒数第二个元素，依此类推。

== 注意LRANGE命令和编程语言区间函数的区别

假如你有一个包含一百个元素的列表，对该列表执行 LRANGE list 0 10 ，结果是一个包含 11 个元素的列表，这表明 stop 下标也在 LRANGE 命令的取值范围之内(闭区间)，这和某些语言的区间函数可能不一致，比如 Ruby 的 `Range.new`, `Array#slice` 和 Python 的 `range()` 函数。

== 超出范围的下标

超出范围的索引不会产生错误。 如果 start 大于列表末尾，则返回空列表。 如果 stop 大于列表的实际末尾，Redis 会将其视为列表的最后一个元素。

== 返回值

https://redis.io/docs/reference/protocol-spec/#resp-integers[整数]: 指定范围内的元素列表。

== 示例

[source,text]
----
redis> LRANGE mylist 0 0
1) "one"
redis> LRANGE mylist -3 2
1) "one"
2) "two"
3) "three"
redis> LRANGE mylist -100 100
1) "one"
2) "two"
3) "three"
redis> LRANGE mylist 5 10
(empty array)
redis>
----
