= LTRIM

**语法**

[source,text]
----
LTRIM key start stop
----

**可用版本**：1.0.0

**时间复杂度**：O(N)，其中 N 是要通过操作移除的元素的数量。

**ACL 类别**：**@write, @list, @slow**

Redis LTRIM 用于修剪(trim)一个已存在的 list，这样 list 就会只包含指定范围的指定元素。start 和 stop 都是由 0 开始计数的， 这里的 0 是列表里的第一个元素（表头），1 是第二个元素，以此类推。

例如： LTRIM foobar 0 2 将会对存储在 foobar 的列表进行修剪，只保留列表里的前 3 个元素。

start 和 end 也可以用负数来表示与表尾的偏移量，比如 -1 表示列表里的最后一个元素， -2 表示倒数第二个，等等。

超过范围的下标并不会产生错误：如果 `start` 超过列表尾部，或者 `start > end`，结果会是列表变成空表（即该 key 会被移除）。
如果 end 超过列表尾部，Redis 会将其当作列表的最后一个元素。

LTRIM 的一个常见用法是和 `LPUSH/RPUSH` 一起使用。 例如：

[source,text]
----
LPUSH mylist someelement
LTRIM mylist 0 99
----

这对命令会将一个新的元素 push 进列表里，并保证该列表不会增长到超过 100 个元素。
例如，当使用 Redis 存储日志时，这非常有用。 需要注意的是，以这种方式使用时，LTRIM 是一种 O(1) 操作，因为在平均情况下，仅从列表尾部删除一个元素。

== 返回值

https://redis.io/docs/reference/protocol-spec/#resp-simple-strings[简单字符串]:

== 示例

[source,text]
----
redis> RPUSH mylist "one"
(integer) 1
redis> RPUSH mylist "two"
(integer) 2
redis> RPUSH mylist "three"
(integer) 3
redis> LTRIM mylist 1 -1
"OK"
redis> LRANGE mylist 0 -1
1) "two"
2) "three"
redis>
----
