= RPOP

**语法**

[source,text]
----
RPOP key [count]
----

**可用版本**：1.0.0

**时间复杂度**：O(N)，其中 N 是返回的元素数量

**ACL 类别**：**@write, @list, @fast**

移除并返回列表 key 的最后一个元素。

默认情况下，该命令从列表末尾弹出单个元素。 当提供可选的 `count` 参数时，回复将包含最多 `count` 个元素，具体取决于列表的长度。

== 返回值

当不带 count 参数调用时：

https://redis.io/docs/reference/protocol-spec/#resp-bulk-strings[批量字符串]：最后一个元素的值，如果 key 不存在则为 nil。

当使用 count 参数调用时：

https://redis.io/docs/reference/protocol-spec/#resp-arrays[数组]：弹出元素的列表，如果 key 不存在则为 nil。

== 示例

[source,text]
----
redis> RPUSH mylist "one" "two" "three" "four" "five"
(integer) 5
redis> RPOP mylist
"five"
redis> RPOP mylist 2
1) "four"
2) "three"
redis> LRANGE mylist 0 -1
1) "one"
2) "two"
redis>
----

== 历史

* 从 Redis 版本 6.2.0 开始：添加了 count 参数。
