= GETEX

**语法**

[source,text]
----
GETEX key [EX seconds | PX milliseconds | EXAT unix-time-seconds |
  PXAT unix-time-milliseconds | PERSIST]
----

**可用版本**：6.2.0

**时间复杂度**：O(1)

**ACL 类别**：**@write, @string, @fast**

获取 key 的值并可以选择设置其过期时间。 `GETEX` 与 `GET` 类似，但它是一个附加选项的写入命令。

== 选项

GETEX 命令支持一组修改其行为的选项：

* EX 秒 -- 设置指定的过期时间，以秒为单位。
* PX 毫秒 -- 设置指定的过期时间，以毫秒为单位。
* EXAT timestamp-seconds -- 设置 key 过期的指定 Unix 时间（以秒为单位）。
* PXAT timestamp-milliseconds -- 设置 key 过期的指定 Unix 时间（以毫秒为单位）。
* PERSIST -- 删除与 key 相关的生存时间。


== 返回值

https://redis.io/docs/reference/protocol-spec/#resp-bulk-strings[批量字符串回复]: key 的值，如果 key 不存在则为 nil。

== 示例

[source,text]
----
redis> SET mykey "Hello"
"OK"
redis> GETEX mykey
"Hello"
redis> TTL mykey
(integer) -1
redis> GETEX mykey EX 60
"Hello"
redis> TTL mykey
(integer) 60
redis>
----
