= GETSET

**语法**

[source,text]
----
GETSET key value
----

IMPORTANT: 从 Redis 版本 6.2.0 开始，此命令被视为已弃用。 迁移或编写新代码时，可以将其替换为带有 `GET` 参数的 `SET`。

**可用版本**：1.0.0

**时间复杂度**：O(1)

**ACL 类别**：**@write, @string, @fast**

以原子方式将 key 设置为 value 并返回存储在 key 中的旧值。 当 key 存在但不包含字符串值时返回错误。 成功的 SET 操作后，与该 key 关联的任何生存时间都将被丢弃。

== 设计模式

`GETSET` 可以与 `INCR` 一起使用，用于原子重置计数。 例如：每次发生某些事件时，进程可能会针对键 `mycounter` 调用 `INCR`，但有时我们需要获取计数器的值并将其自动重置为零。
这可以使用 `GETSET` `mycounter` "0" 来完成：

[source,text]
----
redis> INCR mycounter
(integer) 1
redis> GETSET mycounter "0"
"1"
redis> GET mycounter
"0"
redis>
----

== 返回值

https://redis.io/docs/reference/protocol-spec/#resp-bulk-strings[批量字符串回复]: key 中存储的旧值，或者当 key 不存在时为 nil.


== 示例

[source,text]
----
redis> SET mykey "Hello"
"OK"
redis> GETSET mykey "World"
"Hello"
redis> GET mykey
"World"
redis>
----
