= SETRANGE

**语法**

[source,text]
----
SETRANGE key offset value
----

**可用版本**：2.2.0

**时间复杂度**：O(1)，不计算将新字符串复制到位所花费的时间。通常，这个字符串很小，所以分摊的复杂度是O(1)。否则，复杂性为O(M)，其中M是值参数的长度。

**ACL 类别**：**@write, @string, @slow**

SETRANGE 命令从偏移量 offset 开始， 用 value 参数覆盖键 key 中储存的字符串值，直至 value 的整个长度。 如果偏移量大于 key 处字符串的当前长度，则用零字节填充该字符串以使偏移量适合。 不存在的 key 被视为空字符串，
因此 SETRANGE 命令可以保证 key 中的字符串足够长，以便将 value 覆盖到 key 中。

请注意，因为 Redis 字符串的大小被限制在 512 兆以内， 所以用户能够使用的最大偏移量为 229 - 1(536870911) ， 如果要使用比这更大的空间， 可以用多个 key 。

WARNING: 当生成一个很长的字符串时， 因 Redis 需要分配内存空间， 这种操作有时候可能会造成服务器阻塞。 在2010年生产的Macbook Pro上， 设置偏移量为 536870911(分配512MB 内存)将耗费约 300 毫秒， 设置偏移量为 134217728(分配128MB 内存)将耗费约 80 毫秒， 设置偏移量 33554432(分配32MB 内存)将耗费约 30 毫秒， 设置偏移量为 8388608(分配8MB 内存)将耗费约 8 毫秒。

== 模式

借助 SETRANGE 和类似的 GETRANGE 命令，您可以将 Redis 字符串用作具有 O(1) 随机访问的线性数组。 在许多现实世界的用例中，这是一种非常快速且高效的存储。

== 返回值

https://redis.io/docs/reference/protocol-spec/#resp-integers[整数]: 被命令修改后的字符串长度.


== 示例

.基本用例
[source,text]
----
redis> SET key1 "Hello World"
"OK"
redis> SETRANGE key1 6 "Redis"
(integer) 11
redis> GET key1
"Hello Redis"
redis>
----

.使用0填充的例子
[source,text]
----
redis> SETRANGE key2 6 "Redis"
(integer) 11
redis> GET key2
"Redis"
redis>
----
